In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.Series([1,2,3,4,5,6,7,np.nan,9,np.nan])
print(data)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    NaN
8    9.0
9    NaN
dtype: float64

In [3]:
#to detect missing values
data.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
9     True
dtype: bool

In [4]:
# Detect existing (non-missing) values.
data.notnull()

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7    False
8     True
9    False
dtype: bool

In [5]:
#createing a dataframe
dictionary={
    0:["a","b","c","d",np.nan],
    1:["x","y","z",np.nan,"m"],
    2:["p","q","r","s",np.nan],
    3:[np.nan,"e",np.nan,"g","h"]
}
print(dictionary)

df=pd.DataFrame(dictionary)
df

{0: ['a', 'b', 'c', 'd', nan], 1: ['x', 'y', 'z', nan, 'm'], 2: ['p', 'q', 'r', 's', nan], 3: [nan, 'e', nan, 'g', 'h']}

     0    1    2    3
0    a    x    p  NaN
1    b    y    q    e
2    c    z    r  NaN
3    d  NaN    s    g
4  NaN    m  NaN    h

In [6]:
df.isnull()

       0      1      2      3
0  False  False  False   True
1  False  False  False  False
2  False  False  False   True
3  False   True  False  False
4   True  False   True  False

In [7]:
df_fill=df.fillna(10)
df_fill

    0   1   2   3
0   a   x   p  10
1   b   y   q   e
2   c   z   r  10
3   d  10   s   g
4  10   m  10   h

In [8]:
# to fill perticular values in perticular columns
df_particular_values=df.fillna({0:"e",1:"L",2:"T",3:"d"})
df_particular_values

   0  1  2  3
0  a  x  p  d
1  b  y  q  e
2  c  z  r  d
3  d  L  s  g
4  e  m  T  h

In [9]:
# fills the nan value with previous observation/row value
df_fill_previous_observation=df.fillna(method="ffill")
df_fill_previous_observation

   0  1  2    3
0  a  x  p  NaN
1  b  y  q    e
2  c  z  r    e
3  d  z  s    g
4  d  m  s    h

In [10]:
#if you specify the limit,then only for those many 'NaN' values in a column it will fill the values
df_fil_previous_observation_only_2_limit=df.fillna(method="ffill",limit=2)
df_fil_previous_observation_only_2_limit

   0  1  2    3
0  a  x  p  NaN
1  b  y  q    e
2  c  z  r    e
3  d  z  s    g
4  d  m  s    h

In [11]:
#numeric DataFrame
dict1 = {
    0:[1,4,7,np.nan],
    1:[2,5,np.nan,np.nan],
    2:[3,np.nan,np.nan,np.nan],
    3:[np.nan,np.nan,np.nan,np.nan]
}

df_2 = pd.DataFrame(dict1)
df_2

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [12]:
#drops an entire row if one nan value is present
df_2.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [13]:
df_2.dropna(axis=1,how="all")

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  7.0  NaN  NaN
3  NaN  NaN  NaN

In [14]:
#drops an entire row and column if nan value are present
df_2.dropna(how="all")

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN

In [15]:
#Filling the null values
df2_fill=df_2.fillna(10)
df2_fill

      0     1     2     3
0   1.0   2.0   3.0  10.0
1   4.0   5.0  10.0  10.0
2   7.0  10.0  10.0  10.0
3  10.0  10.0  10.0  10.0

In [16]:
# to fill perticular values in perticular columns
df2_fill=df_2.fillna({0:10,1:20,2:30,3:40})
df2_fill

      0     1     2     3
0   1.0   2.0   3.0  40.0
1   4.0   5.0  30.0  40.0
2   7.0  20.0  30.0  40.0
3  10.0  20.0  30.0  40.0

In [17]:
# fills the nan value with previous observation/row value
df2_fill=df_2.fillna(method="ffill")
print(df_2)
df2_fill

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  3.0 NaN
2  7.0  5.0  3.0 NaN
3  7.0  5.0  3.0 NaN

In [18]:
# df.mean()
# gives the mean
# to fill the missing values by the mean values we use mean()

df2_fill_mean=df_2.fillna(df_2.mean())
df2_fill_mean

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  3.0 NaN
2  7.0  3.5  3.0 NaN
3  4.0  3.5  3.0 NaN

In [19]:
# .replace(old_val,new_val)
# replaces the old values with new values
# values can be anything.

ser1=pd.Series([1,2,3,100,4,5,6,100,7,100,100])
ser1

0       1
1       2
2       3
3     100
4       4
5       5
6       6
7     100
8       7
9     100
10    100
dtype: int64

In [20]:
# to replace 100 with 1
ser1.replace(100,1)

0     1
1     2
2     3
3     1
4     4
5     5
6     6
7     1
8     7
9     1
10    1
dtype: int64

In [22]:
ser2=pd.Series([1,2,3,5,7,50,100,150])
ser2.replace(to_replace=[50,100,150],value=8)
ser2

0      1
1      2
2      3
3      5
4      7
5     50
6    100
7    150
dtype: int64

In [24]:
# replacing different values with some other different values
ser1=pd.Series([1,2,100,4,5,100,7,8,100])
print(ser1)
ser1.replace({100:np.nan,1:50})

0      1
1      2
2    100
3      4
4      5
5    100
6      7
7      8
8    100
dtype: int64

0    50.0
1     2.0
2     NaN
3     4.0
4     5.0
5     NaN
6     7.0
7     8.0
8     NaN
dtype: float64

In [25]:
ser2 = pd.Series(list('abcdeabcd'))
ser2

0    a
1    b
2    c
3    d
4    e
5    a
6    b
7    c
8    d
dtype: object

In [26]:
pd.get_dummies(ser2)

   a  b  c  d  e
0  1  0  0  0  0
1  0  1  0  0  0
2  0  0  1  0  0
3  0  0  0  1  0
4  0  0  0  0  1
5  1  0  0  0  0
6  0  1  0  0  0
7  0  0  1  0  0
8  0  0  0  1  0